app/Services/CommentService.php

select * from `posts` where `posts`.`id` = '84' limit 1
select * from `users` where `users`.`id` = 10 limit 1
insert into `comments` (`content`, `userId`, `postId`, `updated_at`, `created_at`) values ('vs', 1, '84', '2024-06-28 21:46:18', '2024-06-28 21:46:18')
---
    public function comment(Request $request, string $id)
    {
        $user = auth()->user();
        $post = Post::find($id);
        $postOwner = User::find($post->userId);

        CacheClearController::Post();
        CacheClearController::CommentClear($id);
        CacheClearController::UserPosts($user->id);
        CacheClearController::UserDetailClear($user->id);
        CacheClearController::NotificationClear($postOwner->id);

        if (!$post) {
            throw new PostException('No Post Found For Commenting.', 404, null, false);
        }

        $transaction = \DB::transaction(function () use ($user, $post, $request, $id, $postOwner) {

            $comment = Comment::create([
                'content' => $request->content,
                'userId' => $user->id,
                'postId' => $id,
            ]);

            if (!$comment) {
                throw new CommentException('Something Went Wrong, Please try again later.', 500, null, true);
            }

            $us = User::find($post->userId);

insert into `notifications` (`userId`, `type`, `data`, `updated_at`, `created_at`) values (1, 'SentComment', '{\"user_id\":10,\"comment_id\":274,\"post_id\":84}', '2024-06-28 21:46:18', '2024-06-28 21:46:18')
---


                $data = json_encode(['user_id' => $us->id, 'comment_id' => $comment->id, 'post_id' => (int)$id]);
                Notification::create([
                    'userId' => $user->id,
                    'type' => 'SentComment',
                    'data' => $data,

                ]);

select * from `comments` where `postId` = '84' order by `created_at` desc
select * from `users` where `users`.`id` in (1)
---
    public function showCommentByPost(string $id)
    {
        $cacheKey = 'post.comments.' . $id;

        $comments = \Cache::remember($cacheKey, 600, function () use ($id) {
            return Comment::where('postId', $id)->with('user')->latest()->get();