app/Services/FollowService.php

    public function follow(string $id)
    {
        $user = auth()->user();
        if ($user->id == $id) {
            throw new FollowException('You Cannot Follow YourSelf.', 400, null, false);
        }


        $existingRelation = Follow::where('followerId', $user->id)->where('followeeId', $id)->first();
        if ($existingRelation) {
            throw new FollowException('Already Followed.', 409, null, false);
        }
        $transaction = DB::transaction(function () use ($user, $id) {
            Follow::create([
                'followerId' => $user->id,
                'followeeId' => $id,
            ]);
            $us = User::find($id);
            $data = json_encode(['follower_id' => $user->id, 'followee_id' => $us->id]);
            Notification::create([
                'userId' => $user->id,
                'type' => 'SentFollow',
                'data' => $data,

            ]);
            $us->notify(new FollowNotification($user, $us));
            return ['message' => 'Followed.'];
        });
---
select * from `follows` where `followerId` = 1 and `followeeId` = '2' limit 1
insert into `follows` (`followerId`, `followeeId`, `updated_at`, `created_at`) values (1, '2', '2024-06-29 01:07:39', '2024-06-29 01:07:39')
select * from `users` where `users`.`id` = '2' limit 1
insert into `notifications` (`userId`, `type`, `data`, `updated_at`, `created_at`) values (1, 'SentFollow', '{\"follower_id\":1,\"user_id\":2}', '2024-06-29 01:07:39', '2024-06-29 01:07:39')