app/Services/LikeService.php

select * from `posts` where `posts`.`id` = '2' limit 1
select * from `users` where `users`.`id` = 1 limit 1
select exists(select * from `likes` where `userId` = 2 and `postId` = '2') as `exists`
insert into `likes` (`userId`, `postId`, `updated_at`, `created_at`) values (2, 2, '2024-06-29 01:00:40', '2024-06-29 01:00:40')
insert into `like_post` (`like_id`, `post_id`) values (2, 2)
---
    public function like(string $id)
    {
        $user = auth()->user();
        $post = Post::find($id);
        $postOwner = User::find($post->userId);

        CacheClearController::Post();
        CacheClearController::UserDetailClear($postOwner->id);
        CacheClearController::UserDetailClear($user->id);
        CacheClearController::UserPosts($user->id);
        CacheClearController::UserPosts($postOwner->id);
        CacheClearController::NotificationClear($postOwner->id);

        if (!$post) {
            throw new PostException('No Post Found.', 404, null, false);
        }
        $existLike = Like::where('userId', $user->id)
            ->where('postId', $id)->exists();
        if ($existLike) {
            throw new LikeException('You Already Liked.', 409, null, false);
        }
        $transaction = DB::transaction(function () use ($user, $post, $postOwner) {
            $like = Like::create([
                'userId' => $user->id,
                'postId' => $post->id,
            ]);
            $post->likes()->attach($like);

insert into `notifications` (`userId`, `type`, `data`, `updated_at`, `created_at`) values (2, 'SentLike', '{\"user_id\":1,\"post_id\":2}', '2024-06-29 01:00:40', '2024-06-29 01:00:40')
---

            if ($user->id != $post->userId) {
                $data = json_encode(['user_id' => $postOwner->id, 'post_id' => $post->id]);
                Notification::create([
                    'userId' => $user->id,
                    'type' => 'SentLike',
                    'data' => $data,

                ]);

select * from `posts` where `posts`.`id` = '74' limit 1
select * from `users` where `users`.`id` = 1 limit 1
delete from `like_post` where `like_post`.`post_id` = 74 and `like_post`.`like_id` in (10)
delete from `likes` where `postId` = '74'
delete from `notifications` where `type` = 'SentLike' and json_contains(`data`, '{\"user_id\":1}') and json_contains(`data`, '{\"post_id\":74}')
---
    public function unlike(string $id)
    {
        $user = auth()->user();

        $post = Post::find($id);
        $us = User::find($post->userId);

        CacheClearController::UserPosts($us->id);
        CacheClearController::Post();
        CacheClearController::UserDetailClear($us->id);
        CacheClearController::UserDetailClear($user->id);
        CacheClearController::UserPosts($user->id);
        CacheClearController::NotificationClear($us->id);

        $transaction = DB::transaction(function () use ($user, $post, $id, $us) {
            $post->likes()->detach($user->id);

            $lk = Like::where('postId', $id)->delete();
            Notification::where('type', 'SentLike')
                ->whereJsonContains('data', ['user_id' => $us->id])
                ->whereJsonContains('data', ['post_id' => (int)$id])
                ->delete();