app/Services/PostService.php

    public function show()
    {
        $cacheKey = 'posts.latest';
        $posts = \Cache::remember($cacheKey, 3600, function () {

            $posts = Post::withCount(['likes', 'comments'])
                ->latest()
                ->get();

            if ($posts->isEmpty()) {
                throw new PostException('No posts made yet.', 404, null, false);
            }

            $posts = $posts->map(function ($post) {
                $post->user->profilepicture = asset('images/' . $post->user->profilepicture);
                $post->image = asset('posts/' . $post->image);

                $user = User::with(['followers', 'following', 'posts'])
                    ->find($post->userId);
                $userr = auth()->user();

                $liked = Like::where('userId', $userr->id)
                    ->where('postId', $post->id)
                    ->exists();
                $post->user->followers_count = $user->followers()->count();
                $post->user->following_count = $user->following()->count();
                $post->user->post_count = $user->posts()->count();
                $post->liked = $liked;


                return $post;
            });
---
select * from `follows` where `follows`.`followerId` in (10)
select * from `users` where `users`.`id` = 10 limit 1
select * from `posts` where `posts`.`userId` in (10)
select exists(select * from `likes` where `userId` = 10 and `postId` = 83) as `exists`
select count(*) as aggregate from `follows` where `follows`.`followerId` = 10 and `follows`.`followerId` is not null
select count(*) as aggregate from `posts` where `posts`.`userId` = 10 and `posts`.`userId` is not null

    public function makePost(Request $request)
    {
        $user = auth()->user();

        CacheClearController::Post();
        CacheClearController::UserPosts($user->id);
        CacheClearController::UserDetailClear($user->id);

        $image = $request->file('image');
        $imageName = uniqid() . '.' . $image->getClientOriginalExtension();
        $image->move(public_path('posts'), $imageName);
        $post = Post::create([
            'userId' => $user->id,
            'content' => $request->content,
            'image' => $imageName,

        ]);
---
insert into `posts` (`userId`, `content`, `image`, `updated_at`, `created_at`) values (1, 'Happy coding in life..!', '667f303e3a923.jpg', '2024-06-29 00:50:54', '2024-06-29 00:50:54')

    public function deletePost(Request $request)
    {
        $user = auth()->user();

        CacheClearController::Post();
        CacheClearController::UserDetailClear($user->id);
        CacheClearController::UserPosts($user->id);

        $post = Post::where('userId', $user->id)->where('id', $request->id)->first();
        $post->delete();
---
select * from `posts` where `userId` = 10 and `id` = '71' limit 1
delete from `posts` where `id` = 71

    public function onePostByUser()
    {
        $cacheKey = 'user.posts.' . auth()->id();

        $posts = \Cache::remember($cacheKey, 3600, function () {

            $user = auth()->user();
            $posts = Post::withCount(['likes', 'comments'])
                ->where('userId', $user->id)
                ->latest()
                ->get();

            if ($posts->isEmpty()) {
                throw new PostException('You don\'t have any posts.', 404, null, false);
            }

            $posts = $posts->map(function ($post) {
                return [
                    'id' => $post->id,
                    'content' => $post->content,
                    'image' => asset('posts/' . $post->image),
                    'created_at' => $post->created_at,
                    'updated_at' => $post->updated_at,
                    'likes_count' => $post->likes_count,
                    'comments_count' => $post->comments_count,
                    'profilepicture' => asset('images/' . $post->user->profilepicture),
                    'name' => $post->user->name,
                    'bio' => $post->user->bio,
                ];
            });
---
select `posts`.*, (select count(*) from `likes` inner join `like_post` on `likes`.`id` = `like_post`.`like_id` where `posts`.`id` = `like_post`.`post_id`) as `likes_count`, (select count(*) from `comments` where `posts`.`id` = `comments`.`postId`) as `comments_count` from `posts` where `userId` = 10 order by `created_at` desc
select * from `users` where `users`.`id` = 10 limit 1