app/Services/UserService.php

    public function login(Request $request)
    {
        $email = $request->email;
        $password = $request->password;

        $user = User::where('email', $email)->first();
---
select * from `users` where `email` = 'zakarea@gmail.com' limit 1

    public function signup(Request $request)
    {
        $transaction = DB::transaction(function () use ($request) {
            $user = User::create([
                'name' => $request->name,
                'email' => $request->email,
                'password' => Hash::make($request->password),
                'profilepicture' => 'dummy.jpg',
            ]);
---
insert into `users` (`name`, `email`, `password`, `profilepicture`, `updated_at`, `created_at`) values ('Zakarea jabbar', 'zakarea@gmail.com', '$2y$10$9Z5z3srihX1cn5e7T0xDi.ml9kqH1OlyYF/3GF.dZq6nozYlbKD.C', 'dummy.jpg', '2024-06-29 00:58:48', '2024-06-29 00:58:48')

    public function SearchForUsers(string $query)
    {
        $users = User::where('name', 'like',   $query . '%')->get();
---
select * from `users` where `name` like 'karimg%'