app/Http/Controllers/NotificationController.php

select count(*) as aggregate from `notifications` where json_contains(`data`, '{\"user_id\":10}') and `read_at` is null
---
    public function CountUnreadNotification()
    {
        $user = auth()->user();
        $cacheKey = 'user.notification.'.$user->id;
        \Cache::forget($cacheKey);

        $cache = \Cache::remember($cacheKey,60*10,function () use($user){
            return  Notification::whereJsonContains('data', ['user_id' => $user->id])
                ->where('read_at', null)
                ->count();

select count(*) as aggregate from `notifications` where json_contains(`data`, '{\"user_id\":10}') and `read_at` is null
---
    static public function CountNotificationBroadcast($id)
    {
        $cacheKey = 'user.notification.'.$id;
        \Cache::forget($cacheKey);

        $cache = \Cache::remember($cacheKey,60*10,function () use($id){
            return  Notification::whereJsonContains('data', ['user_id' => $id])
                ->where('read_at', null)
                ->count();

select * from `notifications` where json_contains(`data`, '{\"user_id\":2}') and `read_at` is null
update `notifications` set `read_at` = '2024-06-29 01:00:56', `notifications`.`updated_at` = '2024-06-29 01:00:56' where `id` = 1
---
    public function SeenNotification()
    {
        $user = auth()->user();
        CacheClearController::NotificationClear($user->id);
        $notifications = Notification::whereJsonContains('data', ['user_id' => $user->id])
            ->whereNull('read_at')
            ->get();

        $notifications->each(function ($notification) {
            $notification->read_at = Carbon::now();
            $notification->save();