app/Http/Controllers/VerificationEmail.php

    public function viaUrl(string $id)
    {
        $randomString = Str::random(32);
        $user = User::find($id);
        $user->remember_token = $randomString;
        $user->save();
---
select * from `users` where `users`.`id` = '1' limit 1
update `users` set `remember_token` = 'N8Xl6SxOofFKmHQG15AagdqR8UiZI3mj', `users`.`updated_at` = '2024-06-29 00:58:48' where `id` = 1

    public function test(string $id)
    {

        $user = User::find($id);
---
select * from `users` where `users`.`id` = '1' limit 1